["明朝景泰年间，宦官专权，大太监曹少钦主持东厂，上挟天子，下令百官，为虎作伥，陷害忠良。他杀害兵部尚书杨宇轩，为将杨的部下一网打尽，故意将杨的一双儿女流放边关。杨宇轩的部下周淮安为救忠良之后，结识了江湖侠女邱莫言，他俩一起住进了“龙门客栈”。该店实为一家黑店，店主金镶玉是个心狠手辣、风情万种的女人，专干杀人越货的勾当。随着东厂三档头贾廷等人的到来，“龙门客栈”一时间成了东厂与周淮安、邱莫言和金镶玉格斗的场所。最后莫言悲壮而死，周和金终于杀死曹少钦，救出两个孩子。最后金镶玉火烧龙门客栈，随周而去。", "明朝景泰年间，东厂大太监曹少钦(甄子丹饰)，将忠良兵部尚书杨宇轩陷害致死，并以流放杨宇轩的儿女为诱饵，引出杨的部下周淮安(梁家辉饰)，妄图将其旧部一网打尽。　　江湖女侠邱莫言(林青霞饰)受周淮安之托，经过浴血厮杀，救出杨家儿女，与周淮安相约在大漠边关的龙门客栈会合。东厂曹少钦手下亲信化装协同一众高手尾随而至。　　以开黑店为营生的“龙门客栈”店主金镶玉(张曼玉饰)风骚多情，对周淮安暗生情愫，而周淮安早已心属莫言。与此同时，曹少钦的大队人马正向龙门客栈杀来，而店内有东厂高手对周淮安及同行江湖义士百般纠缠，又加上大漠风雨莫测，使周淮安等人无法脱身。　　周淮安探知龙门客栈必有一条出关密道，为救杨氏遗孤，周淮安不惜用与金镶玉结婚为条件追问密道所在，并与莫言等人约定新婚之夜由密道逃离龙门关……不料曹少钦的大队人马已然杀到。就在这生、死、爱、恨交织的危急关头，周、莫、金三人众志成城，联手将奸徒伏诛，莫言却因此不幸丧生。周淮安决意远离中原，金镶玉烧毁客栈追随周淮安而去……", "明朝末年，宦官专权，东厂曹少钦假造圣旨、杀害忠良杨宇轩，侠女邱莫言、江湖义士贺虎等人救出忠良后代，逃至龙门客栈，与杨将军部下周淮安会合。 　　客栈老板娘金镶玉十分风骚，她与镇守边关的千户关系非同一般，所以杀人越货，肆无忌惮。她看上英俊潇洒的周淮安，嫉妒邱莫言与他的关系。 　　曹少钦手下亲信贾迁、路小川、常言笑带一帮人马赶到。金镶玉帮助周淮安蒙混过关。为了摸清通往外面的暗道，周淮安将计就计。答应与金成亲。 　　洞房中，周淮安要金镶玉说出暗道，金则要周先与她风流一夜。 　　等不见周淮安的暗号，贺虎急不可耐与东厂展开了一场生死搏斗。经过激烈拼杀，贾迁、常言笑、贺虎都战死。曹少钦赶到，乱箭之中邱莫言受伤。金镶玉带着周淮安、邱莫言及两个孩子在刀不遇的掩护下从暗道逃走。当他们钻出暗道时，又被曹少钦发现。金镶玉将两个孩子交给刀不遇护送出关。三人联手对付曹少钦，莫言悲壮而死，周淮安和金镶玉与赶回来的刀不遇联手终于杀死曹少钦。 　　周淮安养好伤后，离开了“龙门客栈”。金镶玉火烧“龙门客栈”，随周而去。"]