["70岁的老船夫与外孙女翠翠相依为命，老船夫的夙愿就是把翠翠交给一个可靠的人。茶峒城里的船总顺顺有两个儿子天保大老生性憨厚、沉默寡言，傩送二老眉清目秀，唱得一手好山歌。兄弟俩感情深厚，却又同时爱上了翠翠。翠翠喜欢二老，却又不肯说明心意，使得老船夫非常为难。后又因种种误会，事情被搁置下来。但随后传来大老因婚事未成心里郁闷不慎落水淹死的噩耗。老船夫终于明白了翠翠的心意，但二老对哥哥的死难以释怀。老船夫又硬着头皮前去提亲，又被顺顺拒绝。与此同时，顺顺同意了中寨王团的提亲，但二老却因心中仍想着翠翠拒绝婚事，最后慑于父命，以出去闯荡为由，远走逃避。老船夫因心力交瘁，终于在一个雷雨交加的夜晚死去。翠翠终于明白了许多事情，接替起老船夫的工作，守候在渡船上等待二老的归来。", "根据沈从文同名小说改编。　　故事发生在民国初年湘西山区一个偏远的小镇--茶峒城。离城两里有一个渡口，摆渡的是70岁的老船夫和他的外孙女翠翠。17年前，翠翠的母亲因和一个屯防军人相爱而有了孩子，结婚不成却又不愿私奔，便在生下孩子后喝了溪中的冷水死去。17年后，当翠翠长到她母亲当年的年龄时，外孙女的婚事便成了老船夫的一块心病。他只有一个夙愿，就是一定要把翠翠交给一个可靠的人。茶峒城里有一位叫顺顺的船总。他家拥有四条船的业，在方圆几十里内颇有名望。顺顺有两个相貌英俊的儿子，他们都长到了该娶亲的年龄。天保大老生性憨厚、沉默寡言，傩送二老却眉清目秀，唱得一手好山歌，被当地人誉戏台上的\"岳云\"。兄弟俩从小一起长大，感情至深。可在这件事上却发生了矛盾，因他们同时爱上了翠翠。翠翠年方十五，情窦初开。虽然从第一个端午节夜晚偶然邂逅二老，心中生异样情感，但在二老面前却总是躲躲闪闪。这可难了老船夫，当天保大老派人来提亲时，老船夫因不明翠翠心思，说话吞吞吐吐，引起了大老的不满。一天，兄弟俩终于在一个平静的溪边，不动声色地把话挑明了。他们商定，同时到翠翠家对岸小溪的高崖上唱情歌，由苍天选择。老船夫听到情歌，迫不及待地往城里向大老报信，说事情有望。不料，这歌却是二老唱的。半个月过去了，老船夫再没有听到情歌。就在这时，噩耗传来，大老在跟货船下川东经青浪滩时，由于婚事未成，胸中郁闷，不慎落水淹死了。顺顺一家便将大老的死怪罪于老船夫。老船夫因此精神上受到沉重打击。日子一天天过去。老船夫渐渐知道了翠翠心中真正喜欢的人。一日，在摆渡时，遇到二老，老船夫有心招呼他，二老由于手足之情，不能忘记哥哥的死，便对老人报以冷眼。老船夫又硬着头皮到顺顺家去提亲，又被顺顺拒绝。诸多不顺和碰壁使老船夫更加翠翠的命运担忧。这时，中寨王团总派人到顺顺家女儿提亲，他们拿一座新碾房做嫁妆，使顺顺欣然同意。可二老因心中想着翠翠，拒绝了这桩婚事。但慑于父命，只好以跟货船下辰州、出去闯闯理由，远走逃避。老船夫见翠翠婚事无望，自己的夙愿落空，他心力交瘁，终于在一个雷雨交加的夜晚，躺在床上死去。老船夫死后，渡口的木船上，只剩下翠翠一个人了，但翠翠却明白了许多老人在世时所不明白的事。悲痛并没有使她走母亲走过的路，她接替了老船夫的工作，终日来往人摆渡，同时，她守候在渡船上，等待着二老的归来。"]