["在西域有一群身怀绝技的人，他们从事着古老而神秘的职业，用骆驼护送货物辗转各地，被称为骆驼客。戈师傅拥有过人的弓箭技巧，是当地最负盛名的驼队首领，这次，他的驼队刚刚踏上古老驼道，就遭遇到一场惊心动魄的疯狂追杀。心怀鬼胎的队友，女儿与徒弟之间的意乱情迷，危机重重之际，他们走上的很可能是一条不归路。忠诚与背叛，他们能否坚守侠客的信义？在箭与枪的交锋中，谁成为最后的赢家？", "电影《骆驼客》讲述的是民国年间发生在新疆东疆一带驼把式们的故事。在这个故事里让大家应该能感受到，自古生活在西部戈壁沙漠之中人们的生存状态，他们的艰辛、困苦、苍凉和快乐，以及在那个动荡年代中骆驼客们特有的豪情和坚守诚信的信念。 \n        戈师傅——是当地有名的驼把式。他有一个完整的家庭和几个性格各异的徒弟，有自己的驼队且享有盛名。\n        自古以来，在新疆东部地区，年满十二岁的男人们都必须练习射箭和摔跤。骆驼客们在路上相遇，大多都会喝酒摔跤表达他们的喜悦和情谊。渐渐地就变成一种规矩和习俗。\n        二尕子是戈师傅最小的一个徒弟，是驼队在路上收留的孤儿。他和戈师傅的女儿岁数差不多，两个孩子在一起玩耍长大，不知觉的在他们心里有了一种特殊的感情。\n        驼客们不出远道时在家打草，喝酒，射箭，因为师傅酒后的一句玩笑话让二尕子当真，以为射箭赢了师傅就真的可以娶戈师傅的女儿——戈红儿为妻，不知红儿已经许配了人家。不料一位商人——白老板的出现让一切发生了变化，戈师傅与他是老交情白老板也曾救过遇难驼队，戈师傅心存感激便答应了白老板这桩历经险难的生意。此次走的是远道驼队整装待发，顺便把红儿送到婆家去，因为当时动荡的时局在行驶的途中戈师傅不得不改变路线，走没有水源和人烟的老通道。并让二尕子送红儿去婆家。正因这次路线的改变才让原本不愿嫁人的红儿和二尕有了单独的相处，两颗懵懂的心发生了爱的碰撞不顾一切的交织在一起，之后二人在追赶驼队时发现了一些异情并赶上了戈师傅的队伍。\n        正在戈师傅为女儿和徒弟的事情意乱之时，伴随着驼队的不只是环境的恶劣，还有所路之地哈密政府快枪队的阻拦与追杀。戈师傅和他的徒弟们用弓箭与政府的快枪队决绝，在维护骆驼客们千百年来用诚信筑造的信念时，一轮箭与枪的对决让两队人马两败俱伤，戈师傅和他的几个徒弟都牺牲了，只剩下了两个不经世事的孩子，勇敢智谋的戈师傅早把驼队分成了两队，由红儿和尕子继续运送货物。一路上两个勇敢地孩子又与快枪队残留人员斗智斗勇打败了对方，历经千辛终于把货送到黑城子，才知道运送的货物是支援边区政府的枪支。盛世才为了独享后路与苏俄翻脸，禁止一切物资运往陕甘宁地区。\n        一路上的遭遇让两个孩子瞬间成长，同时也捍卫了骆驼客坚守的信念。后来，二尕子做了驼把式有了自己的驼队，继承了师傅用生命延续的诚信，他和红儿生活在了一起。"]