["结识于80年代的大学好友成东青、孟晓骏、王阳一起打架、泡妞、梦想去美国。有的美国梦圆，有的美国梦碎，有的美国梦圆了又碎——惟齐力创办英语培训学校的新梦想，将他们绑在了一起。", "20世纪80年代，三个怀有热情和梦想的年轻人在高等学府燕京大学的校园内相遇，从此展开了他们长达三十年的友谊和梦想征途。出生于留学世家的孟晓骏（邓超 饰）渴望站在美国的土地上改变世界，浪漫自由的王阳（佟大为 饰）尽情享受改革开放初期那蓬勃激昂的青春气息，曾两次高考落榜的农村青年成冬青（黄晓明 饰）以晓骏为目标努力求学，并收获了美好的爱情。然而三个好友最终只有晓骏获得美国签证，现实和梦想的巨大差距让冬青和王阳倍受打击。偶然机缘，被开除公职的冬青在王阳的帮助下办起了英语培训学校，开始品尝到成功的喜悦。在美国发展不顺的晓骏回国，并加入学校，无疑推动三个好友朝着梦想迈进了一大步。　　只是随着成功的降临，他们的友情也开始承受严峻的考验。", "这是个激荡三十年，关于一个土鳖，一个知识分子，还有一个浪漫骑士的“中国式成功”的故事。　　成东青（黄晓明 饰演），农村出身的土鳖，两次高考落败，眼看就要屈服于当农民的命运，他最后一搏，搏命背下整本英文字典，从明眸变成近视眼，第三次试考，考上北大；孟晓骏（邓超 饰演），精英知识分子，强烈自信，内心认定自己永远是最优秀的那个。王阳（佟大为 饰演），八十年代的浪漫派，样子俊朗，热爱文学，一生梦想是当个诗人。这样三个各走极端的人，居然就在北大碰上，戏剧性的建立友谊。　　三子跟八十年代莘莘学子一样，怀抱着一个美国梦。申请签证的结果是：两个成功，一个被拒。土鳖成东青延续失败的命运，眼看两个好友出国完梦，他失望透顶，他只有留在北大任教，却又因在外私自授课，被校方发现，央求悔罪仍被除名，毫无余地的成为一个真正“失败者”。　　美国那边，孟晓峻正要一展抱负，却未料堂堂北大高材生，在美国根本找不着工作，落得在餐馆当侍应助理的命运；王阳签证成功，却因一个一见钟情的美国女孩放弃出国，贯彻其浪漫派个性；成东青一无所有，只有偷偷在肯德基办补习班，其独特的自嘲教学法，却渐渐吸引不少学生。这是命运的安排，他从没想过，被拒签这个人生最失败的挫折，亦是成就他人生中最成功的契机…　　成东青请王阳加入一起办补习班，成东青毋忘孟晓骏，让他回国强势加盟，正式开办“新梦想”学校。三人凭借个人魅力，包括成东青的自嘲式幽默教学法，孟晓骏的美国经验和签证技巧，以及王阳的创新电影教学，让新梦想空前成功。　　新梦想再扩规模，成东青被媒体和青年塑造成为留学教父，不由自控的散发着一股从土鳖蜕变成领导者的光芒，让孟晓骏看不过去，二人渐貌合神离，王阳左右做人难。　　孟晓骏远走沈阳，三人的友情面临重重考验。然大时代一幕又一幕的挑战，包括1999年南斯拉夫中国大使馆被北约军机轰炸、还有ETS美国普林斯出版社控告新梦想侵犯版权，又把三子再次凝聚起来，共同面对新梦想的困境。　　这三个非一般的中国人，是大时代下最具代表性，最激励人心的“中国合伙人”。"]