["影片以一场惊天动地的战争为背景，讲述了一段刻骨铭心的旷世爱情轮回：贪念、背叛、斗争、爱情，几千年来恒久不变地编写着人类的历史。在好友William(梁家辉饰)邀请下，Jack(成龙饰)开始了徘徊生死边缘的考古旅程，慢慢从秦朝宝石发出的神奇漂浮力量牵连到梦中美女的秘密。真相越近，越难解释，也越不能自拔。神话之中，其实也离不开最现实不过的爱恨贪恶的天性。走到濒临生命的终结，因贪婪而声名尽失的古先生不改本色，结果惨死；一心要名留千古的William迷途知返，决定以死补偿过错。有人争名，有人逐利，Jack又会否为情放弃现在，与朝鲜公主玉漱(金喜善饰)拥抱过去，长相厮守呢？", "Jack(成龙饰)和William(梁家辉饰)是好朋友，也是好的合作伙伴，他们都是文物方面的专家。不过Jack一段时间以来总是在梦中梦见自己是秦朝将军蒙毅，并一直在保护某国公主玉漱(金喜善饰)入秦为妃，并且这个梦有时候是白日梦，有时候断断续续的，扑朔迷离。他们俩在印度研究悬浮的秘密时，得到了美女Samantha的热情帮助，并且找到有神秘力量的宝石。他们利用宝石的力量到郦山瀑布群的峡谷中，竟然发现了一直长生不老的玉漱和秦国的宫殿群，他的梦境之谜也完全揭开。但没想到盗墓的古先生也尾随到了此地，他对此走火入魔，强逼玉漱交出长生不老的药丸，在紧要的关头，所有的一切都回归真实。", "骁勇善战的秦朝大将军蒙毅，受秦始皇所命，负责护送朝鲜公主玉漱入秦为妃，路上竟遭承相赵高暗中指使的叛军伏击，蒙毅为保护玉漱公主，二人紧握着手随战车堕入万丈瀑布……　　同一个梦境，已缠绕考古学家Jack(成龙饰)多年，梦中容颜脱俗的白衣女子─玉漱公主(金喜善饰)，更使他神魂颠倒，越发令他对秦朝古物着迷。一天，Jack的好友，热心钻研超自然能量，誓要名留青史的科学家William(梁家辉饰)又带来了新发现，他邀请Jack一同前往印度参与研究神秘漂浮力量。在帝沙的圣殿中，信众膜拜悬于半空的灵棺，二人看得目定口呆，William斗胆摘下祭坛上的宝石，灵棺立即失去浮力堕地粉碎。Jack与William被守墓侍卫与信众穷追，二人分头逃命，失魂落魄的Jack遇印度少女 Samantha带他到高僧师父处暂避，高僧感应到Jack被一段前世缘分困扰。Jack急于解开梦境之谜，决定离开Samantha回中国，到前秦帝都西安。　　Jack在西安秦俑博物馆重遇大难不死的William，他兴奋地向Jack透露，发现灵棺宝石可抵御地心引力，遂将浮力宝石据为己有，William 更投向假借学术盗墓走私的古先生，依附对方的财力，继续进行研究，Jack痛斥William自私的行径；一对曾出身入死的好友因信念回异决裂。　　Jack乘直升机到郦山上空，冒险跳入峡谷中的瀑布，情景一如梦境；另方面William一直借助高科技仪器尾随跟踪，二人同时闯进一条通往「悬浮天宫」的隧道！梦寐以求的玉漱公主，活生生的出现在Jack眼前！守候了数千年的玉漱，终于等到了，信守承诺的蒙毅将军回来找她…　　此时，古先生竟以武力接管「悬浮天宫」，要当长生不老的皇帝！　　着了魔的William在混乱间撬出机关上的宝石，天宫顿时失去浮力，成千上万的兵马俑从空中直坠而下，水银涌出！　　生死一线间，各怀鬼胎的野心家能否回头是岸？Jack与玉漱又会否逃出生天，延续三千年的神话呢？", "成龙扮演的考古学家和同伴在印度进入一座古墓，居然发现一幅公主的画像，公主（金喜善饰）的长相和不断出现在他梦中的女子十分相似。　　为了探究梦境和现实的关系，成龙开始追梦之旅，奇迹般找到了传说中秦始皇陵的所在地……　　蒙毅大将军奉命保护公主抵达秦国，一路上，公主和蒙毅暗生情愫。可蒙毅还是选择了效忠。秦始皇病危，公主很可能入宫就要被处死，为了让公主活下去，蒙毅冒死去拿长生不老药，最后死在沙场。公主试药成功，但奸臣却给秦王服用假药，秦王死后，公主被禁在秦王陵中。　　成龙在秦王陵中，见到了长生不老、等待了千年的公主，她终于等到了转世的爱人……"]