["在《惊天魔盗团》中，天启四骑士用幻术骗过FBI并赢得公众的崇拜。一年后，他们在续集《惊天魔盗团2》中卷土重来，却迎来了新敌人，这个敌人请他们去完成一次最危险的抢劫。", "提示：以下剧情含剧透                                     展开                                                        故事发生在首部曲中四骑士用神奇魔术玩弄了FBI并且成为大众心目中英雄的一年之后。四骑士中的三个人J·丹尼尔·阿特拉斯（杰西·艾森伯格）、梅利特·麦克金尼(伍迪·哈里森)以及杰克·瓦尔德(戴夫·弗兰科）继续隐姓埋名，等待天眼(一个至高无上的魔术师秘密团体)的下一步指示。而他们在FBI中的线人迪伦·罗德（马克·鲁法洛饰）给骑士们下达了一项新任务，那就是让商界明星欧文·凯斯(本·拉姆)的真面目公之于众。凯斯的公司通过手机软件窃取公众影视获取暴利。这时，女魔术师鲁拉·梅找到了骑士团，要求加入，于是取代了已经退出的前成员Henley Reeves。\n　　骑士团大闹凯斯的新软件上市发布会，将FBI引到了会场。然而骑士们没有想到的是，一个神秘人在发布会上向公众披露，骑士团的成员瓦尔德并没有死去，而骑士团一直在欺骗大众，同时罗德的线人身份也被公开。骑士们打算逃走，但掉下了对方预先设计好的“陷阱”，于是在“瞬间”穿越到远离拉斯维加斯千里之外的澳门，这让骑士们百思不得其解。\n　　在澳门，迎接他们的是梅利特的孪生兄弟切斯(伍迪·哈里森)。切斯的老板是一名有着传奇色彩的科技神童瓦尔特·马布瑞(丹尼尔·雷德克里夫)。马布瑞曾经是凯斯的商业伙伴，但遭到了对方背叛，被抢去了公司，之后瓦尔特伪造了自己已经死亡的证据。马布瑞说服骑士们去帮他偷一张芯片，这是凯斯企业研发出的最新技术，被藏在澳门一家赌场下面的秘密设施里。\n　　阿特拉斯接下了这项任务，尽管其他人并不情愿。在澳门一家古老的魔术点，他见到了李(周杰伦)，后者帮助骑士们完成任务。同时罗德从监狱里放走了撒迪厄斯·布莱德利(摩根·弗里曼)，二人一起来到澳门。罗德发现马布瑞其实是亚瑟·特斯勒(迈克尔·凯恩)的儿子。特斯勒为了报仇，将罗德所在一个保险箱里，并且扔进大海，让罗德像从前他的父亲那样以同样的方式死去。在最后时刻，罗德打开了保险箱并且被骑士们从水中救起。\n　　罗德以及骑士们和李一起来到伦敦，执行最后的计划。他们大张旗鼓地制造声势。马布瑞、特斯勒以及切斯破解了骑士们出现的规律，把他们一网打尽，带到了私人飞机之上。马布瑞夺走了电脑芯片，并且将骑士们推出飞机机舱，打算害死他们。然而正当他打开香槟打算庆祝时，才发现自己被骗了。这一切都是骑士们设下了一个惊天大局。在私人飞机上发生的一切都在进行视频直播，全世界的人们都看到了他们的犯罪活动。\n　　马布瑞、特斯勒以及切斯被FBI逮捕，而在罗德奖新片交给FBI之后，骑士们被免除了罪名。罗德与骑士们来到一座秘密的图书馆，他们发现李其实是天眼组织的一位高级成员。更让罗德意外的是，撒迪厄斯终于公布了自己的真实身份。他并非是罗德父亲的敌人，而是他的好朋友和搭档。他们表面上剑拔弩张的敌对关系只不过是魔术表演中用来掩人耳目的手段一部分而已。骑士们和罗德在布莱德利的目光注视之下，开始去了解更多关于天眼的秘密……"]