["年轻的石油工人刘思成(刘烨 饰)是单位的业务标兵，喜欢收藏王铁人的所有物品。刘思成的父亲刘文瑞(张铎 饰)是和王铁人并肩战斗过的战友。铁人后辈的身份带给刘思成无上荣誉的同时 也日益成为他的困扰。 在美丽的心理医师吴梦夏(马苏 饰)的帮助下，刘思成开始尝试打开心结。　　与此同时，赵一林(黄渤 饰)因和女友的不检行为被揭发而双双被迫离队。恼羞成怒的赵一林当众怒斥此事的惟一知情人刘思成，认为刘和他的父亲刘文瑞一样都是只知道沽名钓誉的骗子。父亲到底是和铁人战斗到底的英雄，还是如赵一林所言半路当了逃兵？伴随着刘思成的追问，时光退回到半个世纪前……　　一列破旧的火车把王进喜(吴刚 饰)和他的1205钻井队从甘肃玉门油田拉到了大庆。作为石油大会战的主力军，王进喜和他的队伍肩负着让新中国甩掉贫油帽子的希望。这只除却血肉之躯和钢铁意志几乎一无所有的队伍在队长王进喜的带领下，苦干5天5夜，大庆第一口油井终于开钻。房东老大娘见王进喜连续数昼夜奋战在井架，感慨“王队长真是个铁人！”，“王铁人”的名字从此传开。　　第一口油井打好之后，王进喜的腿被滚落的钻杆砸伤，他却顾不上住院。拄着拐杖缠着绷带连夜回到井队。突遇第二口油井即将发生井喷，在没有重晶石粉堵塞井喷的危急时刻，他当机立断用水泥代替，水泥沉在泥浆池底必须搅拌，现场却没有搅拌机，王进喜便扔掉双拐，纵身跳进泥浆池，用身体搅拌泥浆。在他的带动下，工友们也纷纷跳进入，经过三个多小时奋战，井喷终于被制服，油井和钻机保住了。　　三年自然灾害来临，王进喜和他的队伍面遇到前所未有的考验。在严重的饥饿和高强度的作业下，队友们意志纷纷崩溃。王进喜省出自己的口粮，甚至不惜犯政治错误，想方设法给大家填肚子。看似粗枝大叶的王进喜对爱徒“小知识份子” 刘文瑞更呵护备至，还让妻子为其缝补护膝。刘文瑞最终还是偷偷踏上了返程的火车，师傅王进喜留下的那袋口粮和孤独的背影却成了刘文瑞一生的心债。　　伴随着对这段回忆的追惜，刘思成陪父亲度过了他最后的时光。此时传来离队的赵一林和女友在沙漠遇险的消息，刘思成毫不犹豫地只身开始他的搜救行动。恍惚间，刘思成的眼前出现了王铁人父亲一样的笑脸……", "故事在现代的沙漠石油钻探作业与上世纪六十年代的大庆\"石油大会战\"之间交替进行。　　年轻的石油工人刘思成是\"铁人\"王进喜战友的儿子，从小背负着父亲的殷切希望。然而随着事实的被揭开，刘思成原本的世界轰然倒塌。他经历了思想认识的巨大转变，重新认识了过去的那个时代和那些人，对自己进行了重新定位，也重新构建了自己的精神世界。　　故事塑造了上世纪六十年代以\"铁人\"王进喜为代表的一代石油工人的坚毅形象，也描绘了新的历史时代条件下新一代石油工人的风貌和精神世界。影片将展现两代石油工人之间的精神传承与对话，生动地表现\"铁人\"精神在新时代的继承和发扬。"]