["世上本就没有一个人能够完全了解另一个人，无论是父母，兄弟，还是朋友都一样，马杰一直都这么想。　　黑六和黑七却可以彼此了解，从不用语言，只需一个眼神或奔跑时遗落的风声，更何况黑七看到了黑六最后的那滴眼泪，还有在白光闪过之后脖颈中喷礴而出像晚霞般灿烂的鲜血。　　因为黑六和黑七不仅是兄弟，而且还是雄性的驴。　　无论生命的形式是什么，如果太聪明了就会有很多不必要的烦恼和痛苦，如果要完全摆脱这种烦恼和痛苦，最彻底的就只有一种办法\"死\"！　　黑六没有意识到这一点，最终的结局只能被杀。　　黑七却意识到了这一点，它选择了自杀！在一个飘雪的午夜，它将自己点燃，灿烂的火焰就像黄昏时分灿烂的晚霞，照亮整个世界。　　雪还在下……                                                                                                                    　　荒唐的年代，两只驴和一个人的故事。　　七十年代，城市知青马杰插队来到某山区参加生产劳动，与当地农村少女彩凤相知相恋。　　一次偶然，在山上凿炮眼负伤的马杰被送到公社卫生所治疗。缝针时他见识了麻药的威力，临走顺手牵羊偷了一支麻药和针管，带回村里。　　村里养着一头公驴黑六，它不用下田干活，每年只管配种，在村里享有特殊的地位和其他牲口艳羡的待遇。饲养员的工作相对轻松，马杰觊觎许久。　　回到村里，马杰悄悄给黑六打了两针麻药，令它暂时瘫软。黑六的“怪病”惊动了生产队队长大莲和众村民，就连兽医也束手无策，马杰又利用麻药过劲儿的时机，佯装治好了黑六。马杰取得了队长的信任，也得到了饲养员的工作。　　马杰不满黑六只交配不干活的待遇，对侍候黑六忿忿不平。一天他违反规定擅自让黑六拉车，被大莲队长发现，队长严厉批评马杰，马杰越发怨恨黑六。当晚，马杰鞭打教训了黑六，未料一时失手竟铸成大错。　　第二年春天，邻村农民牵母驴来和黑六交配，黑六一反常态，再不发情，难以完成配种任务。经兽医判断，黑六的生殖能力已彻底丧失，只能下地干活。　　马杰和彩凤的关系日益亲密，马杰深感幸福，一心想娶彩凤为妻。　　黑六犁地拉磨都费劲，脾气又火爆，一次驮村贫协主任进城，半路将人甩下，致其险些丧命。　　队长决定杀掉黑六，并指派马杰下手。从未杀过生的马杰顶着巨大的心理压力，挥下铡刀，杀了黑六。　　黑六死后，它的弟弟黑七表现异常。意想不到的是，这头驴竟渐渐表现出了令人讶异的智力和感情。　　黑七咬断了支撑牲口棚的木桩，牲口棚塌下，一匹母马被砸死，马杰在倒塌的一瞬钻进井里才得以幸免。　　倒棚事故后，马杰被罚修棚、送粪。马杰迁怒黑七，人驴之间的矛盾再度激化。马杰私下里常捉弄黑七，黑七也送给马杰变本加厉的报复。　　马杰和彩凤愈发如胶似漆，终于有一天，情投意合的两人难捺激动，偷食了禁果。谁也没想到，黑七竟以自己的方式将酣睡中的他们暴露于光天化日之下，并引来村民围观。这对年轻人的爱情遭到了毁灭性的打击。　　彩凤爹不同意马杰娶彩凤，甚至不许马杰和彩凤见面。彩凤被送出村子，不知去向。倍受创伤的马杰终于爆发，但正当他威胁黑七之时却被大莲队长发现，马杰被免职，又干起了打炮眼的活儿。　　黑七仿佛铁了心似地要为被杀的黑六报仇，几次三番欲致马杰于死地，最后为了与马杰同归于尽，不惜自焚。场院堆积的稻草全被黑七点燃，黑七死了，马杰拼死逃脱，拣了条命。但生产队以马杰严重破坏生产资料，致使牲口死亡为名，将马杰移送外地，监督劳动。　　十年后，马杰牵着女儿的手，走在色彩缤纷的街上。突然发现前方一群围观的人，原来是在看杀驴，马杰上前想通过自己的方式营救驴，结果被人当场击倒，马杰的女儿大声地哭喊，驴在叫……                                                        我来添加"]